Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartRotationDiff
Part rotation difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartRotationDiff.#ctor(Tekla.Structures.Identifier,System.Int32,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartRotationDiff class.
id: The object identifier.
posIndex: The position index.
physicalRotation: The physical rotation.
analysisRotation: The analysis rotation.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartRotationDiff.PosIndex
Gets the position index.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartRotationDiff.PhysicalRotation
Gets the physical rotation.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartRotationDiff.AnalysisRotation
Gets the analysis rotation.